package com.hillel.dunaievsky.homeworks.homework3;

public class MyApp1

/*
    Reset видаляє всі коміти вище за вибраний. Там пропонується чотири варіанти цієї команди. Відмінність їх у тому, як зробити зі змінами в робочому каталозі та в індексі.
    Revert не видаляє комміт, а створює новий, який описує дії, необхідні для скасування обраного комміту.
    Undo дозволяє скасувати останній комміт. Але зміни комміта пропонує зберегти в новому changelist. Файли в робочому каталозі не зміняться і можна буде підправити їх і заново закоммітити.
    Drop – зручна команда для видалення довільного комміту із середини історії. Під капотом там фактично виконується інтерактивний rebase, але в автоматичному режимі.
    Revert Selected Changes нагадує Revert, але скасовує зміни окремого файлу, а не всього комміту. Ця команда доступна на панелі змінених файлів.
    Get дозволяє повернути будь-який файл до стану певного коміту в історії. Виберемо файл будь-яким зручним способом та контекстне меню Git | Show History покаже всі комміти, у яких змінювався цей файл. Клікнувши на потрібному коміті правою кнопкою побачимо команду Get
 С gitHub
 тестовый толчок
     */
{
}
